{"weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"dtype": "float32", "shape": [1024, 76], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [76], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [76, 256], "name": "embedding_1/embeddings"}, {"dtype": "float32", "shape": [256, 3072], "name": "gru_1/kernel"}, {"dtype": "float32", "shape": [1024, 3072], "name": "gru_1/recurrent_kernel"}, {"dtype": "float32", "shape": [3072], "name": "gru_1/bias"}]}], "modelTopology": {"keras_version": "2.1.6-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "dtype": "float32", "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 256, "trainable": true, "embeddings_regularizer": null, "input_dim": 76, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [1, null], "activity_regularizer": null, "input_length": null}}, {"class_name": "GRU", "config": {"recurrent_activation": "sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 1024, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "kernel_constraint": null, "activation": "tanh", "stateful": true, "reset_after": false, "dropout": 0.0, "recurrent_regularizer": null, "name": "gru_1", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 76, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_1"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.1.6-tf", "convertedBy": "TensorFlow.js Converter v1.1.2", "format": "layers-model"}